Project/Toir/src/InformationRegisters/ФИОФизическихЛиц/ФИОФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/ФИОФизическихЛиц/Forms/РедактированиеИстории/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВедущийОбъект", ОбъектВладелец);
	Если Не ЗначениеЗаполнено(ОбъектВладелец) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Если объект еще не заблокирован для изменений и есть права на изменение набора
	// попытаемся установить блокировку.
	Если НЕ Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры") Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли; 
	
	Если ТолькоПросмотр Тогда
		
		Элементы.НаборЗаписей.ТолькоПросмотр = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, 
			"ФормаКомандаОК",
			"Доступность",
			Ложь);
			
		Элементы.ФормаКомандаОтмена.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
		
	Для Каждого ЗаписьНабора Из Параметры.МассивЗаписей Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ЗаписьНабора);
	КонецЦикла;
	
	НаборЗаписей.Сортировать("Период");
	
	ДатаОтсчетаПериодическихСведений = ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборЗаписей

&НаКлиенте
Процедура НаборЗаписейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			Элемент.ТекущиеДанные.ФизическоеЛицо = ОбъектВладелец;
			НовыйПериод = ЗарплатаКадрыКлиентСервер.ДатаСеанса();
			Если НаборЗаписей.Количество() > 1 Тогда
				ЗаписьФИОФизическихЛиц = НаборЗаписей.Получить(НаборЗаписей.Количество() - 2);
				Элемент.ТекущиеДанные.Фамилия 	= ЗаписьФИОФизическихЛиц.Фамилия;
				Элемент.ТекущиеДанные.Имя 		= ЗаписьФИОФизическихЛиц.Имя;
				Элемент.ТекущиеДанные.Отчество 	= ЗаписьФИОФизическихЛиц.Отчество;
				ПоследнийПериод = ЗаписьФИОФизическихЛиц.Период;
			Иначе
				ПоследнийПериод = '00010101000000';
			КонецЕсли; 
			Если НовыйПериод <= ПоследнийПериод Тогда
				НовыйПериод = КонецДня(ПоследнийПериод) + 1;
			КонецЕсли; 
			Элемент.ТекущиеДанные.Период = НовыйПериод;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НЕ ОтменаРедактирования Тогда
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Период) Тогда
				ТекстСообщения = НСтр("es='Es necesario indicar la fecha de las noticias';ru='Необходимо указать дату сведений';en='Required to specify information date'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "НаборЗаписей.Период",, Отказ);
			Иначе
				НайденныеСтроки = НаборЗаписей.НайтиСтроки(Новый Структура("Период", Элемент.ТекущиеДанные.Период));
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Если НайденнаяСтрока <> Элемент.ТекущиеДанные Тогда
						ТекстСообщения = НСтр("es='Hay ya una anotación con la fecha indicada de las noticias';ru='Уже есть запись с указанной датой сведений';en='Already have a record with the specified date of information'");
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "НаборЗаписей.Период",, Отказ);
						Прервать;
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
